{
  "exciter": {
    "impulse": {
      "level": "Control the level of the input signal. The value of this parameter directly corresponds to the amplitude of the impulse sample.",
      "density": "Control the length of the impulse, in samples. Higher values induce a low-pass effect."
    },
    "noise": {
      "level": "Control the level of the white noise signal. The value of this parameter directly corresponds to the amplitude of the white noise"
    },
    "sampler": {
      "gain": "Control the gain of the sampler, in decibels.",
      "loop": "If enabled, the sampler will loop the sample indefinitely. If disabled, the sampler will play the sample once and then stop.",
      "start": "Choose where playback should start. A value of 0 corresponds to the beginning of the sample, and a value of 1 corresponds to the end of the sample."
    }
  },
  "resonator": {
    "gain": "Control the gain of the resonator.",
    "solo": "Solo the resonator, intercepting and routing its output directly to the main output. The output of the rest of the synth will be silenced. ",
    "pitch": "Set the pitch of the resonator with respect to the current MIDI note. The resonator will produce sound at this frequency, and will resonate strongly with any harmonically related input signals.",
    "frequency": "Set the absolute frequency of the resonator, unrelated to the current MIDI note. The resonator will produce sound at this frequency, and will resonate strongly with any harmonically related input signals.",
    "keytrack": "If enabled, the resonator can be tuned with respect to the current MIDI note. Otherwise, the resonator can be tuned to a constant frequency.",
    "decay": "Adjust the decay time of the resonator. Lower values correspond to stronger damping and a shorter note. If set to zero, the resonator will be bypassed entirely and the exciter signal will pass through to the post filter.",
    "dispersion": "Dispersion occurs when different frequencies travel at different speeds through a vibrating object. This parameter controls the amount of dispersion in the resonator. Higher values induce a inharmonic, metallic timbre.",
    "loopfilterkeytrack": "If enabled, the loop filter's cutoff frequency will be set with respect to the current MIDI note. Otherwise, the filter cutoff can be set to a constant frequency.",
    "loopfiltercutoff": "Set the cutoff frequency of the waveguide filter. This corresponds to damping present in the string. Higher cutoff frequencies produce a brighter sound. When in keytrack mode, the filter's resonant frequency is tuned to the current MIDI note with respect to this offset.",
    "loopfilterresonance": "Set the resonance of the waveguide filter. Higher resonance values induce waveguide resonance at the peak frequency of the filter, which is tuned to the current MIDI note when in keytrack mode. When resonance is nonzero, waveguide will be strongly damped at all other frequencies.",
    "loopfiltermode": "Choose whether the waveguide filter should be a low-pass filter, band-pass filter, or high-pass filter."

  },
  "resonatorbank": {
    "inputgain": "Set the gain of the input signal to the waveguide bank",
    "outputgain": "Set the gain of the waveguide bank's output",
    "inputmix": "Mix between the exciter signal and the previous waveguide bank's output signal. Has no effect on the first waveguide bank.",
    "coupling": "Set the coupling mode employed by this waveguide bank. In parallel mode, each resonator is excited individually by the input signal. In interlinked mode, the output of all resonators is fed into the input of each resonator. In cascade mode, the output of the nth resonator is fed into the input of the n+1th resonator.",
    "cascadeamount": "Set the level of each cascade signal between adjacent resonators. The output of the nth resonator will be multiplied by this amount before being fed into the n+1th resonator.",
    "cascadefiltercutoff": "Set the cutoff frequency of the filter applied to each cascade signal.",
    "cascadefilterresonance": "Set the resonance of the filter applied to each cascade signal. Higher values produce a more pronounced peak at the cutoff frequency.",
    "cascadefiltermode": "Set the mode of the cascade signal filters. A mode of 0 corresponds to a lowpass filter, a mode of 0.5 corresponds to a bandpass filter, and a mode of 1 corresponds to a highpass filter. Intermediate values interpolate these extrema.",
    "usesemitones": "Toggle resonator tuning by semitones or by frequency multiplier. If enabled, the resonator frequency will be modified by the number of semitones in the Pitch field. If disabled, the resonator frequency will be multiplied by the value in the Pitch field.\n\nThis is a quality-of-life feature and has no effect on the timbre of the resonator."
  }
}