{
  "exciter": {
    "impulse": {
      "level": "Control the level of the input signal. The value of this parameter directly corresponds to the amplitude of the impulse sample.",
      "density": "Control the length of the impulse, in samples. Higher values induce a low-pass effect."
    },
    "noise": {
      "level": "Control the level of the white noise signal. The value of this parameter directly corresponds to the amplitude of the white noise"
    },
    "sampler": {
      "gain": "Control the gain of the sampler, in decibels.",
      "loop": "If enabled, the sampler will loop the sample indefinitely, between the start and end positions. If disabled, the sampler will play the sample once and then stop.",
      "start": "Choose where playback should start. A value of 0 corresponds to the beginning of the sample, and a value of 1 corresponds to the end of the sample.",
      "end": "Choose where playback should end. A value of 0 corresponds to the beginning of the sample, and a value of 1 corresponds to the end of the sample."
    },
    "external": {
      "gain": "Control the gain of the external input signal, in decibels.",
      "constantnote": "If enabled, a constant MIDI note will be supplied to the instrument at all times, allowing Resonarium to be used as an audio effect without complex MIDI routing. MIDI input from the host will still be processed and played as normal while this parameter is engaged.",
      "constantnotefrequency": "Set the frequency of the constant MIDI note. This is implemented via a MIDI MPE pitch bend signal; therefore, the frequency range is limited by the MPE pitch bend range. At a default value of +-48 semitones, this parameter is bounded between ~10 Hz and ~3000 Hz. Values exceeding this range are clamped appropriately."
    }
  },
  "resonator": {
    "gain": "Control the gain of the resonator.",
    "solo": "Solo the resonator, intercepting and routing its output directly to the main output. The output of the rest of the synth will be silenced. ",
    "pitch": "Set the pitch of the resonator with respect to the current MIDI note. The resonator will produce sound at this frequency, and will resonate strongly with any harmonically related input signals.",
    "frequency": "Set the absolute frequency of the resonator, unrelated to the current MIDI note. The resonator will produce sound at this frequency, and will resonate strongly with any harmonically related input signals.",
    "keytrack": "If enabled, the resonator can be tuned with respect to the current MIDI note. Otherwise, the resonator can be tuned to a constant frequency.",
    "decay": "Adjust the decay time of the resonator. Lower values correspond to stronger damping and a shorter note. If set to zero, the resonator will be bypassed entirely and the exciter signal will pass through to the post filter.",
    "dispersion": "Dispersion occurs when different frequencies travel at different speeds through a vibrating object. This parameter controls the amount of dispersion in the resonator. Higher values induce a inharmonic, metallic timbre.",
    "loopfilterkeytrack": "If enabled, the loop filter's cutoff frequency will be set with respect to the current MIDI note. Otherwise, the filter cutoff can be set to a constant frequency.",
    "loopfiltercutoff": "Set the cutoff frequency of the waveguide filter. This corresponds to damping present in the string. Higher cutoff frequencies produce a brighter sound. When in keytrack mode, the filter's resonant frequency is tuned to the current MIDI note with respect to this offset.",
    "loopfilterresonance": "Set the resonance of the waveguide filter. Higher resonance values induce waveguide resonance at the peak frequency of the filter, which is tuned to the current MIDI note when in keytrack mode. When resonance is nonzero, waveguide will be strongly damped at all other frequencies.",
    "loopfiltermode": "Choose whether the waveguide filter should be a low-pass filter, band-pass filter, or high-pass filter."
  },
  "resonatorbank": {
    "inputgain": "Set the gain of the input signal to the waveguide bank",
    "outputgain": "Set the gain of the waveguide bank's output",
    "inputmix": "Mix between the exciter signal and the previous waveguide bank's output signal. Has no effect on the first waveguide bank.",
    "coupling": "Set the coupling mode employed by this waveguide bank. In parallel mode, each resonator is excited individually by the input signal. In interlinked mode, the output of all resonators is fed into the input of each resonator. In cascade mode, the output of the nth resonator is fed into the input of the n+1th resonator.",
    "cascadeamount": "Set the level of each cascade signal between adjacent resonators. The output of the nth resonator will be multiplied by this amount before being fed into the n+1th resonator.",
    "cascadefiltercutoff": "Set the cutoff frequency of the filter applied to each cascade signal.",
    "cascadefilterresonance": "Set the resonance of the filter applied to each cascade signal. Higher values produce a more pronounced peak at the cutoff frequency.",
    "cascadefiltermode": "Set the mode of the cascade signal filters. A mode of 0 corresponds to a lowpass filter, a mode of 0.5 corresponds to a bandpass filter, and a mode of 1 corresponds to a highpass filter. Intermediate values interpolate these extrema.",
    "usesemitones": "Toggle resonator tuning by semitones or by frequency multiplier. If enabled, the resonator frequency will be modified by the number of semitones in the Pitch field. If disabled, the resonator frequency will be multiplied by the value in the Pitch field.\n\nThis is a quality-of-life feature and has no effect on the timbre of the resonator."
  },
  "modulation": {
    "sync": "Sync the rate of this modulation source to the host tempo.",
    "env": {
      "attack": "Set the attack time of the envelope, in seconds.",
      "decay": "Set the decay time of the envelope, in seconds.",
      "sustain": "Set the sustain level of the envelope, as a fraction of the peak level.",
      "release": "Set the release time of the envelope, in seconds."
    },
    "lfo": {
      "rate": "Set the rate of the LFO, in Hertz.",
      "retrig": "Choose whether to retrigger the LFO on each new note.",
      "beat": "Set the rate of the LFO with respect to the host tempo.",
      "stereo": "Set the phase offset between the left and right channels of the LFO. A value of 0 corresponds to a phase offset of 0 degrees, and a value of 1 corresponds to a phase offset of 180 degrees.",
      "depth": "Set the modulation depth of this LFO, i.e. the amplitude of the modulation signal.",
      "phase": "Apply a constant phase offset to the LFO.",
      "wave": "Choose the waveform of this LFO"
    },
    "rand": {
      "rate": "Set the rate of the random modulation source, in Hertz. The modulator will sample and hold a new random value at this rate.",
      "beat": "Set the rate of the random modulation source with respect to the host tempo.",
      "stereo": "Choose how strongly the left and right channels of the random modulation source are correlated. A value of 0 corresponds to perfect correlation, and a value of 1 corresponds to total independence between the channels.",
      "depth": "Set the modulation depth of this random modulation source, i.e. the amplitude of the modulation signal.",
      "chaos": "Choose how similar each random value is to the previous random value. A value of 0 corresponds to a constant signal, whereas a value of 1 corresponds to a completely random signal.",
      "smooth": "Smooth the transition between successive random samples."
    }
  },
  "global": {
    "gain": "Set the gain of the main output signal, in decibels.",
    "polyfx": "Choose whether to use polyphonic effect chains. If enabled, each note will have its own effect chain. If disabled, all notes will share a single effect chain. Disabling improves performance, but effect parameters will no longer be polyphonically modulable.",
    "numvoices": "Set the number of voices in the synthesizer. Each voice has its own effect chain and modulation sources. Increasing the number of voices will increase the CPU load.",
    "stereo": "Choose whether to enable stereo resonators. If enabled, resonators will maintain a different internal state for the left and right channels, and will support stereo modulation. Disabling will improve performance, but disable stereo effects from the resonators."
  }
}